#include<conio.h>
#include<stdio.h>
#include<locale.h>

int main(){
	setlocale(0, "");
	const int n;
	int i, a[n], k, t=0;
//-----------------------------------------------------------------------
	printf("Размер массива\n");
	scanf("%d",&n);
	
	printf("Значения массива\n");
	for(i=0 ; i < n ; i++){
		scanf("%d",&a[i]);
	}
	printf("число ");
	scanf("%d",&k);
			
//-----------------------------------------------------------------------
	for(i=0 ; i < n ; i++){
		if(pow(k,2) == a[i]){
			t=t+a[i];
		}
	}
//-----------------------------------------------------------------------
	if(t!=0){
		printf("сумма квадратов числа %d = %d\n", k, t);
	} else {
		printf("нет подходящих");
	}
	getch();
}
