#include<conio.h>
#include<stdio.h>
#include<locale.h>

int main(){
	setlocale(0, "");
	const int n;
	int i, k=0, s=1, a[n], t=0, a1, b;
//-----------------------------------------------------------------------
	printf("Промежуток от ");
	scanf("%d",&a1);
	printf("и до ");
	scanf("%d",&b);
	
	printf("Размер массива\n");
	scanf("%d",&n);
	
	printf("Значения массива\n");
	for(i=0 ; i < n ; i++){
		scanf("%d",&a[i]);
	}		
//-----------------------------------------------------------------------
	for(i=0 ; i < n ; i++){
		if(a[i]>=a1 && a[i]<=b){
			k++;
			s=s*a[i];
			t=1;
		}
	}
//-----------------------------------------------------------------------
	if(t==1){
		printf("количество элементов массива пододящих по условию = %d\nпроизведение элементов из массива пододящих по условию = %d\n", k, s);
	} else {
		printf("нет подходящих");
	}
	getch();
}
