#include<conio.h>
#include<stdio.h>
#include<math.h>
#include<locale.h>

int main(){
	setlocale(0, "");
	const int n;
	int i, a[n], c=0, ci=0, k=0;
	float r=0;
	
//------<ввод>-----------------------------------------------------------------
	printf("Размер массива\n");
	scanf("%d",&n);
	
	printf("Значения массива\n");
	for(i=0 ; i < n ; i++){
		scanf("%d",&a[i]);
	}
	
//------<операции>-----------------------------------------------------------------
	for(i=0 ; i < n ; i++){
		k++;
		r=r+a[i];
	}
	r=r/k;
	
	for(i=0 ; i < n ; i++){
		if(fabs(r-c) > fabs(r-a[i])){
			c = a[i];
			ci = i;
		}
	}
//------<вывод>-----------------------------------------------------------------

	printf("среднее значение = %.2f\nближайшее к нему = #%d - %d", r, ci, c);
	
	getch();
}
