#include<conio.h>
#include<stdio.h>
#include<locale.h>

int main(){
	setlocale(0, "");
	const int n;
	int i, a[n], t=0,k;
	float r=0;
//-----------------------------------------------------------------------
	printf("Размер массива\n");
	scanf("%d",&n);
	
	printf("Значения массива\n");
	for(i=0 ; i < n ; i++){
		scanf("%d",&a[i]);
	}
//-----------------------------------------------------------------------
	for(i=0 ; i < n ; i++){
		if((a[i]+1)%2==0){
			t=1;
			k++;
			r=r+a[i];
		} 
	}
//-----------------------------------------------------------------------
	if(t==1){
		r=r/k;
		printf("среднее арифметическое всех положительных чётных чисел = %f", r);
	} else {
		printf("нет подходящих");
	}
	getch();
}
