#include<conio.h>
#include<stdio.h>
#include<locale.h>

int main(){
	setlocale(0, "");
	const int n;
	int i, a[n], max=0, min=9999999;
//----<ввод>-------------------------------------------------------------------
	printf("Размер массива\n");
	scanf("%d",&n);		
	
	printf("Значения массива\n");
	for(i=0 ; i < n ; i++){
		scanf("%d",&a[i]);	
	}
			
//----<операции>-------------------------------------------------------------------
	for(i=0 ; i < n ; i++){				
		if(a[i]%2==0){
			if(a[i]>max) max = a[i];
		}
		if((a[i]+1)%2==0) {
			if(a[i]<min) min = a[i];
		}
	}
//----<вывод>-------------------------------------------------------------------
	printf("Amax = %d\nAmin = %d", max, min);
	getch();
}
